VuDaiDuong-23520359/MPU-MCU_project/STM32/Core/Src/main.c
        case 2:
            // Transition blue → red
            factor1 = 1.0f - ((float)((ind % 60) - 40) / 20.0f);
            factor2 = ((float)((ind % 60) - 40) / 20.0f);
            rr = (uint8_t)(255.0f * factor2);
            gg = 0;
            bb = (uint8_t)(255.0f * factor1);
            break;
    }

    // Store results
    *red = rr;
    *green = gg;
    *blue = bb;
}

// Helper function to map frequency to color temperature (warm to cool)
void frequency_to_color_temp(uint16_t freq, uint8_t* r, uint8_t* g, uint8_t* b) {
    if (freq < 250) {
        // Low frequencies: Warm colors (Red to Orange)
        float ratio = (float)freq / 250.0f;
        *r = 255;
        *g = (uint8_t)(ratio * 165); // Orange component
        *b = 0;
    } else if (freq <= 2000) {
        // Mid frequencies: Yellow to Green
        float ratio = (float)(freq - 250) / 1750.0f;
        *r = (uint8_t)(255 * (1.0f - ratio)); // Fade out red
        *g = 255;
        *b = 0;
    } else {
        // High frequencies: Cool colors (Green to Blue to Violet)
        float ratio = (freq - 2000) / 18000.0f; // Up to 20kHz
        if (ratio > 1.0f) ratio = 1.0f;

        if (ratio < 0.5f) {
            // Green to Blue
            float t = ratio * 2.0f;
            *r = 0;
            *g = (uint8_t)(255 * (1.0f - t));
            *b = (uint8_t)(255 * t);
        } else {
            // Blue to Violet
            float t = (ratio - 0.5f) * 2.0f;
            *r = (uint8_t)(128 * t);
            *g = 0;
            *b = 255;
        }
    }
}

// Helper function to map frequency to full spectrum (Red to Violet)
void frequency_to_full_spectrum(uint16_t freq, uint8_t* r, uint8_t* g, uint8_t* b) {
    // Map frequency to hue (0-300 degrees)
    float hue = (float)freq / 7000.0f * 300.0f; // 0-7kHz mapped to 0-300°
    if (hue > 300.0f) hue = 300.0f;

    HSV_to_RGB(hue, 1.0f, 1.0f, r, g, b);

}

#define AMP_THRESHOLD 1000     // Amplitude threshold to detect a beat
#define FADE_DURATION_MS 500   // Fade duration in milliseconds
void effect_flash_fade_random_color(uint16_t amp, uint16_t peakHz, uint8_t brightness_mode) {
    static uint32_t last_flash_time = 0;  // Time of the last flash

    uint32_t current_time = HAL_GetTick();  // Current time in milliseconds

    // Beat detection: Check if amplitude exceeds threshold
    if (amp > AMP_THRESHOLD) {
        // Generate a random RGB color (0-255)
        uint8_t r = rand() % 256;
        uint8_t g = rand() % 256;
        uint8_t b = rand() % 256;

        // Set all LEDs to the new random color
        for (int i = 0; i < MAX_LED; i++) {
            Set_LED(i, r, g, b);
        }

        // Update the last flash time to start a new fade cycle
        last_flash_time = current_time;
    }

    // Calculate elapsed time since the last flash
    uint32_t elapsed_time = current_time - last_flash_time;

    // Calculate brightness based on elapsed time
    int brightness;
    if (elapsed_time >= FADE_DURATION_MS) {
        brightness = 0;  // Fully faded out
    } else {
        // Linear fade: brightness decreases from BRIGHTNESS_MODE to 0
        brightness = brightness_mode - (brightness_mode * elapsed_time) / FADE_DURATION_MS;
    }

    // Apply the calculated brightness to the LEDs
    Set_Brightness(brightness);

    // Update the LED strip
    WS2812_Send();
}

void effect_dynamic_vu_meter(uint16_t amplitude, uint16_t peak_freq, uint8_t brightness_mode) {
    // Calculate ratio and number of LEDs to light
    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    if (ratio <= 0.05f) {
        Turn_off_all_at_once();
        return;
    }

    int total_leds_to_light = (int)(ratio * MAX_LED);
    if (total_leds_to_light < 1) total_leds_to_light = 1;

    // Get color based on frequency
    uint8_t r, g, b;
    frequency_to_full_spectrum(peak_freq, &r, &g, &b);

    // Clear all LEDs first
    Turn_off_all_at_once();

    // Light LEDs from center outward
    int center = MAX_LED / 2;
    int leds_per_side = total_leds_to_light / 2;

    // Light center LED if odd number
    if (total_leds_to_light % 2 == 1) {
        Set_LED(center, r, g, b);
    }

    // Light LEDs on both sides of center
    for (int i = 1; i <= leds_per_side; i++) {
        if (center - i >= 0) {
            Set_LED(center - i, r, g, b);
        }
        if (center + i < MAX_LED) {
            Set_LED(center + i, r, g, b);
        }
    }

    int brightness = 5 + (int)(ratio * (brightness_mode - 5));
    Set_Brightness(brightness);
    WS2812_Send();
}

void effect_spectrum_color_bands(uint16_t amplitude, uint16_t peak_freq, uint8_t brightness_mode) {
    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    if (ratio <= 0.05f) {
        Turn_off_all_at_once();
        return;
    }

    // Define frequency bands and LED sections
    int low_start = 0;
    int low_end = MAX_LED / 3;
    int mid_start = low_end;
    int mid_end = (MAX_LED * 2) / 3;
    int high_start = mid_end;
    int high_end = MAX_LED;

    // Clear all LEDs
    Turn_off_all_at_once();

    // Determine which band the peak frequency falls into
    uint8_t r = 0, g = 0, b = 0;
    int start_led = 0, end_led = 0;

    if (peak_freq <= 250) {
        // Low frequency band - Red
        frequency_to_full_spectrum(peak_freq, &r, &g, &b);
        start_led = low_start;
        end_led = low_end;
    } else if (peak_freq <= 2000) {
        // Mid frequency band - Green
    	frequency_to_full_spectrum(peak_freq, &r, &g, &b);
        start_led = mid_start;
        end_led = mid_end;
    } else {
        // High frequency band - Blue
    	frequency_to_full_spectrum(peak_freq, &r, &g, &b);
        start_led = high_start;
        end_led = high_end;
    }

    // Light up the appropriate section
    for (int i = start_led; i < end_led; i++) {
        Set_LED(i, r, g, b);
    }

    int brightness = 5 + (int)(ratio * (brightness_mode - 5));
    Set_Brightness(brightness);
    WS2812_Send();
}

