VuDaiDuong-23520359/MPU-MCU_project/STM32/Core/Src/main.c
// Structure to hold pulse data
typedef struct {
    int position;           // Current position of pulse
    uint8_t r, g, b;       // Color of pulse
    uint8_t brightness;    // Brightness of pulse
    uint8_t length;        // Length of pulse in LEDs
    uint8_t active;        // Whether pulse is active
} Pulse;

#define MAX_PULSES 8
static Pulse pulses[MAX_PULSES];
static uint16_t last_amp = 0;
static uint32_t last_pulse_time = 0;

void effect_frequency_chase_gradient(uint16_t amplitude, uint16_t peak_freq, uint8_t brightness_mode) {
    const uint16_t BEAT_THRESHOLD = 800;  // Adjust based on your amp_maxn
    const uint32_t MIN_PULSE_INTERVAL = 100; // Minimum time between pulses (ms)

    uint32_t current_time = HAL_GetTick();

    // Beat detection: amplitude spike above threshold
    if (amplitude > BEAT_THRESHOLD &&
        amplitude > (last_amp + 200) &&
        (current_time - last_pulse_time) > MIN_PULSE_INTERVAL) {

        // Find an inactive pulse slot
        for (int i = 0; i < MAX_PULSES; i++) {
            if (!pulses[i].active) {
                // Initialize new pulse
                pulses[i].position = 0;
                frequency_to_full_spectrum(peak_freq, &pulses[i].r, &pulses[i].g, &pulses[i].b);

                float ratio = (float)amplitude / amp_maxn;
                if (ratio > 1.0f) ratio = 1.0f;

                pulses[i].brightness = (uint8_t)(ratio * 255);
                pulses[i].length = 3 + (uint8_t)(ratio * 8); // 3-11 LEDs long
                pulses[i].active = 1;

                last_pulse_time = current_time;
                break;
            }
        }
    }

    // Clear all LEDs
    Turn_off_all_at_once();

    // Update and draw all active pulses
    for (int i = 0; i < MAX_PULSES; i++) {
        if (pulses[i].active) {
            // Draw pulse with fade-out trail
            for (int j = 0; j < pulses[i].length; j++) {
                int led_pos = pulses[i].position - j;
                if (led_pos >= 0 && led_pos < MAX_LED) {
                    // Calculate fade factor for trail
                    float fade = 1.0f - ((float)j / pulses[i].length);
                    uint8_t r = (uint8_t)(pulses[i].r * fade);
                    uint8_t g = (uint8_t)(pulses[i].g * fade);
                    uint8_t b = (uint8_t)(pulses[i].b * fade);

                    // Blend with existing LED color (simple additive)
                    uint8_t existing_r = LED_Data[led_pos][2];
                    uint8_t existing_g = LED_Data[led_pos][1];
                    uint8_t existing_b = LED_Data[led_pos][3];

                    r = (r + existing_r > 255) ? 255 : r + existing_r;
                    g = (g + existing_g > 255) ? 255 : g + existing_g;
                    b = (b + existing_b > 255) ? 255 : b + existing_b;

                    Set_LED(led_pos, r, g, b);
                }
            }

            // Move pulse forward
            pulses[i].position++;

            // Deactivate pulse if it's moved off the strip
            if (pulses[i].position >= MAX_LED + pulses[i].length) {
                pulses[i].active = 0;
            }
        }
    }

    Set_Brightness(brightness_mode);
    WS2812_Send();

    last_amp = amplitude;
}

void effect_rainbow_roll(uint16_t amplitude, uint16_t peak_freq, uint8_t brightness_mode) {
    static float offset = 0.0f;

    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    // Cập nhật offset dựa vào tần số đỉnh
    offset += ((float)peak_freq / 100.0f);  // tốc độ cuộn
    if (offset >= 360.0f) offset -= 360.0f;

    for (int i = 0; i < MAX_LED; i++) {
        float hue = fmodf(offset + (i * (360.0f / MAX_LED)), 360.0f);
        uint8_t r, g, b;
        HSV_to_RGB(hue, 1.0f, ratio, &r, &g, &b);
        Set_LED(i, r, g, b);
    }

    int brightness = 5 + (int)(ratio * (brightness_mode - 5));
    Set_Brightness(brightness);
    WS2812_Send();
}

#define BASS_THRESHOLD 1200		// tăng để LED sáng hơn
#define BASS_FADE_MS 300		// tăng để LED tắt chậm hơn

void effect_bass_pulse_glow(uint16_t amplitude, uint16_t peak_freq, uint8_t brightness_mode) {
    static uint32_t last_bass_time = 0;
    static float hue = 0.0f;
    uint32_t now = HAL_GetTick();

    // Nếu là bass mạnh → cập nhật thời gian và màu sắc (hue)
    if (peak_freq <= 250 && amplitude > BASS_THRESHOLD) {
        last_bass_time = now;

        hue += 30.0f;  // Tăng hue để chuyển màu theo dải cầu vồng
        if (hue >= 360.0f) hue -= 360.0f;
    }

    // Tính độ sáng fade theo thời gian kể từ lần bass gần nhất
    uint32_t elapsed = now - last_bass_time;
    int brightness;

    if (elapsed >= BASS_FADE_MS) {
        brightness = 0;
    } else {
        brightness = brightness_mode - (brightness_mode * elapsed) / BASS_FADE_MS;
    }

    // Chuyển hue → RGB
    uint8_t r, g, b;
    HSV_to_RGB(hue, 1.0f, 1.0f, &r, &g, &b);  // Độ sáng sẽ được điều chỉnh sau bằng Set_Brightness()

    // Set toàn bộ LED thành màu đang có
    for (int i = 0; i < MAX_LED; i++) {
        Set_LED(i, r, g, b);
    }

    Set_Brightness(brightness);
    WS2812_Send();
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  srand(HAL_GetTick());
  uint8_t mode_button_index = 0;
  uint8_t brightness_button_count = 0;

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_TIM1_Init();
  MX_ADC1_Init();
  MX_TIM2_Init();
  /* USER CODE BEGIN 2 */

  HAL_TIM_Base_Start(&htim2);
  HAL_ADC_Start_IT(&hadc1);
  arm_rfft_fast_init_f32(&fftHandler, FFT_BUFFER_SIZE);
  HAL_Delay(50); // delay de co thoi gian de lay sample offset_point

  float	peakVal	= 0.0f;

  /* USER CODE END 2 */

